{
  "backend/main.mo": "Implements access‑controlled user profile storage with admin‑only role assignment and exact‑name search.",
  "feature_evidence.json": "Feature evidence report linking admin user‑promotion functionality to affected frontend files and components.",
  "frontend-file-summaries.txt": "Contains prewritten summaries for various frontend files describing their purpose and behavior.",
  "frontend/index.css": "Defines Tailwind layers and OKLCH design tokens for light and dark themes with global styling rules.",
  "frontend/index.html": "Basic HTML entry point mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Sets up TanStack Router routes, theme provider, and application shell for all role‑based pages.",
  "frontend/src/components/auth/AuthGate.tsx": "Authentication guard that checks Internet Identity state and displays a login prompt if unauthenticated.",
  "frontend/src/components/auth/BecomeAdminButton.tsx": "UI component letting users access or request admin status, including token‑based admin onboarding.",
  "frontend/src/components/common/PrimaryActionBar.tsx": "Sticky bottom action bar wrapper for primary mobile‑friendly page actions.",
  "frontend/src/components/common/StatusPill.tsx": "Badge component that displays a status label with variant‑based styling.",
  "frontend/src/components/common/WireframeSection.tsx": "Reusable card section wrapper with title, description, content, and optional action area.",
  "frontend/src/components/layout/AppShell.tsx": "Top-level layout that manages header, navigation visibility, role sync with backend admin status, and page structure.",
  "frontend/src/components/navigation/RoleNav.tsx": "Renders navigation buttons based on the current app role and routes for that role.",
  "frontend/src/components/operator/DowntimeDurationPanel.tsx": "Displays a card showing the current downtime duration if provided.",
  "frontend/src/components/operator/OptionalPhotoUploadWireframe.tsx": "Presents a placeholder UI for optional photo upload with a button and preview mockup.",
  "frontend/src/components/supervisor/KpiTile.tsx": "Card component showing a KPI value with status, optional icon, and subtitle.",
  "frontend/src/components/user/UserIdentityBadge.tsx": "Shows the logged-in user's identity, role badge, and provides a logout button that clears state and cache.",
  "frontend/src/hooks/useActor.ts": "Creates and caches a backend actor tied to the user's identity and refreshes dependent queries when it changes.",
  "frontend/src/hooks/useAppRole.ts": "Zustand store for persisting and managing the user's selected app role with helper flags.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides authentication state and actions using Internet Identity, managing identity loading, login, and logout.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for fetching and mutating user profiles, roles, admin status, and admin actions via the actor.",
  "frontend/src/index.css": "Tailwind CSS setup defining theme variables, dark mode, typography, and utility classes for an industrial UI.",
  "frontend/src/lib/demoData.ts": "Defines demo machine data, TPM checklist items, and a generated demo submission with remarks.",
  "frontend/src/lib/utils.ts": "Provides a utility function to merge CSS class names using clsx and tailwind-merge.",
  "frontend/src/main.tsx": "Initializes the React app with React Query and Internet Identity providers.",
  "frontend/src/pages/admin/AdminMachinesPage.tsx": "Renders machine management UI with a dialog to add machines and a table of demo machine statuses.",
  "frontend/src/pages/admin/AdminPlannedMaintenancePage.tsx": "Displays planned maintenance schedules and includes a form dialog for creating new schedules.",
  "frontend/src/pages/admin/AdminUsersPage.tsx": "Implements user search and admin role promotion with backend queries and status alerts.",
  "frontend/src/pages/auth/LoginPage.tsx": "Provides a login screen that triggers Internet Identity authentication.",
  "frontend/src/pages/auth/RoleLandingPage.tsx": "Handles initial user flow including profile setup, admin check, and role selection before routing.",
  "frontend/src/pages/maintenance/MaintenanceJobDetailPage.tsx": "Displays maintenance job details and allows updating progress, repair time, and root cause before closing the job.",
  "frontend/src/pages/maintenance/MaintenanceJobsListPage.tsx": "Shows a list of maintenance breakdown jobs with status indicators and navigation to each job's detail page.",
  "frontend/src/pages/operator/OperatorHomePage.tsx": "Provides operator home navigation to update machine status, complete TPM checklist, or select a machine.",
  "frontend/src/pages/operator/OperatorStatusConfirmationPage.tsx": "Shows confirmation after submitting a machine status update with a button to return home.",
  "frontend/src/pages/operator/OperatorStatusUpdatePage.tsx": "Form for operators to record machine status, times, and downtime details with validation before submission.",
  "frontend/src/pages/operator/OperatorTpmChecklistPage.tsx": "Displays TPM checklist items grouped by category, allowing operators to mark items, add remarks, and submit.",
  "frontend/src/pages/operator/OperatorTpmConfirmationPage.tsx": "Shows confirmation after submitting a TPM checklist with navigation back to the operator home.",
  "frontend/src/pages/supervisor/SupervisorApprovalDetailPage.tsx": "Displays detailed TPM submission for supervisor review including checklist items, remarks, and approval actions.",
  "frontend/src/pages/supervisor/SupervisorApprovalsListPage.tsx": "Displays a list of TPM approvals with operator, machine, and status, allowing navigation to individual approval details.",
  "frontend/src/pages/supervisor/SupervisorDashboardPage.tsx": "Shows a supervisor dashboard with machine performance stats and recent activity logs.",
  "frontend/src/pages/supervisor/SupervisorMissedActivitiesPage.tsx": "Provides filters and a list of missed TPM activities by machine, operator, and date.",
  "frontend/src/pages/supervisor/SupervisorReportsPage.tsx": "Lists downloadable production and maintenance reports with descriptions and dates.",
  "frontend/src/routes/appRoutes.tsx": "Defines route configurations and role-based filtering for app navigation.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, storing, and clearing URL and session-based parameters.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending theme colors, animations, and layout settings.",
  "project_state.json": "Defines the project’s schema, high-level TPM Line Monitor app description, architectural notes, and a list of implemented UI wireframe features for all user roles. Contains no issues and tracks versioned feature entries for authentication, operator flows, autonomous maintenance, and supervisor dashboards."
}