{
  "backend/main.mo": "Actor with access control mixin managing user profiles, enforcing permissions, and allowing admins to promote users.",
  "feature_evidence.json": "Feature evidence report linking frontend files and components to implementing the admin promotion flow.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose of various frontend files in the project.",
  "frontend/index.css": "Global Tailwind base layer defining light/dark theme CSS variables and applying background/foreground styles.",
  "frontend/index.html": "HTML entry point mounting the React app at #root and loading main.tsx.",
  "frontend/src/App.tsx": "Configures TanStack Router with all app routes and wraps pages in the AppShell layout.",
  "frontend/src/components/auth/AuthGate.tsx": "Auth wrapper that shows a login prompt until Internet Identity authentication completes.",
  "frontend/src/components/auth/BecomeAdminButton.tsx": "Button and dialog guiding users through admin token usage or granting admin access if already authorized.",
  "frontend/src/components/common/PrimaryActionBar.tsx": "Sticky bottom action bar container for primary page actions.",
  "frontend/src/components/common/StatusPill.tsx": "Badge component rendering status labels with themed styling variants.",
  "frontend/src/components/common/WireframeSection.tsx": "Card-based section wrapper with title, description, actions, and content areas.",
  "frontend/src/components/layout/AppShell.tsx": "Wraps the main app layout, syncing user role with backend admin status and rendering header, nav, content, and footer.",
  "frontend/src/components/navigation/RoleNav.tsx": "Renders navigation buttons based on the current app role and routes.",
  "frontend/src/components/operator/DowntimeDurationPanel.tsx": "Displays a card showing the current downtime duration.",
  "frontend/src/components/operator/OptionalPhotoUploadWireframe.tsx": "Provides a wireframe UI for optional photo uploads with a placeholder preview.",
  "frontend/src/components/supervisor/KpiTile.tsx": "Shows a KPI card with title, value, status indicator, and optional icon or subtitle.",
  "frontend/src/components/user/UserIdentityBadge.tsx": "Displays the logged-in user's name and role with a logout button.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the current identity, invalidating dependent queries on change.",
  "frontend/src/hooks/useAppRole.ts": "Uses Zustand to persist and manage the user's selected application role.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity login, logout, and identity state management via context.",
  "frontend/src/hooks/useQueries.ts": "Contains React Query hooks for fetching and updating user profiles, roles, and admin status through the actor.",
  "frontend/src/index.css": "Defines Tailwind-based global styles and theme variables for light and dark modes.",
  "frontend/src/lib/demoData.ts": "Provides demo machine definitions, TPM checklist items, and example TPM submission data.",
  "frontend/src/lib/utils.ts": "Exports a utility function for merging Tailwind class names.",
  "frontend/src/main.tsx": "Initializes the React app with QueryClient and InternetIdentityProvider wrappers.",
  "frontend/src/pages/admin/AdminMachinesPage.tsx": "Displays a machine management page with a list of demo machines and a dialog to add new machines.",
  "frontend/src/pages/admin/AdminPlannedMaintenancePage.tsx": "Shows planned maintenance schedules and provides a form dialog to create new maintenance tasks.",
  "frontend/src/pages/admin/AdminUsersPage.tsx": "Provides a user management UI listing users and includes a dialog to add new user accounts.",
  "frontend/src/pages/auth/LoginPage.tsx": "Renders the login screen using Internet Identity and redirects authenticated users.",
  "frontend/src/pages/auth/RoleLandingPage.tsx": "Handles post-login onboarding, including profile setup and role selection before routing users by role.",
  "frontend/src/pages/maintenance/MaintenanceJobDetailPage.tsx": "Displays breakdown job details and allows maintenance technicians to update progress and close the job.",
  "frontend/src/pages/maintenance/MaintenanceJobsListPage.tsx": "Displays a list of static maintenance jobs with status pills and navigation to job detail pages.",
  "frontend/src/pages/operator/OperatorHomePage.tsx": "Provides operator navigation to status updates, TPM checklist, and machine selection.",
  "frontend/src/pages/operator/OperatorStatusConfirmationPage.tsx": "Shows a success confirmation after an operator submits a machine status update.",
  "frontend/src/pages/operator/OperatorStatusUpdatePage.tsx": "Form for operators to record machine status, times, and downtime details with validation before submission.",
  "frontend/src/pages/operator/OperatorTpmChecklistPage.tsx": "Displays grouped TPM checklist items with checkboxes, remarks, optional photo upload, and submit action.",
  "frontend/src/pages/operator/OperatorTpmConfirmationPage.tsx": "Shows a confirmation screen after an operator submits a TPM checklist.",
  "frontend/src/pages/supervisor/SupervisorApprovalDetailPage.tsx": "Displays the details of a TPM submission for supervisors to review, add remarks, and approve or reject.",
  "frontend/src/pages/supervisor/SupervisorApprovalsListPage.tsx": "Lists TPM submissions with their status and allows supervisors to navigate to approval detail pages.",
  "frontend/src/pages/supervisor/SupervisorDashboardPage.tsx": "Supervisor dashboard showing machine status metrics, OEE, breakdowns, maintenance, TPM compliance, and recent activity logs.",
  "frontend/src/pages/supervisor/SupervisorMissedActivitiesPage.tsx": "Page with filters and a list displaying machines with missed TPM activities, operators, and dates.",
  "frontend/src/pages/supervisor/SupervisorReportsPage.tsx": "Report download page listing various production and maintenance reports with download actions.",
  "frontend/src/routes/appRoutes.tsx": "Defines role-based route configuration and provides a helper to filter routes by user role.",
  "frontend/src/utils/urlParams.ts": "Utility function to read a URL query parameter from the browser location.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining theme extensions, colors, animations, and plugin usage.",
  "project_state.json": "Project metadata and feature tracking for the TPM Line Monitor app, including architecture notes and implemented features."
}