{
  "kind": "build_request",
  "title": "Promote named user (Uday Chougule) to Admin",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-13",
      "text": "Add a backend admin-only API that allows an existing Admin to promote another user (not the caller) to the Admin role, so the app can make the user named \"Uday Chougule\" an admin.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Make Uday Chougule as a admin"
        ]
      },
      "acceptanceCriteria": [
        "When called by a backend Admin, the API promotes the specified user to the admin role.",
        "When called by a non-admin, the API traps/returns an authorization error and does not change any roles.",
        "The promoted user is recognized as admin by existing backend admin checks (e.g., `isCallerAdmin()` and any `getCallerUserRole()` logic)."
      ]
    },
    {
      "id": "REQ-14",
      "text": "Add a backend admin-only query API to support identifying the correct account for \"Uday Chougule\" (e.g., list known user profiles with their principals and names, or provide a lookup that resolves a principal by exact profile name).",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Make Uday Chougule as a admin"
        ]
      },
      "acceptanceCriteria": [
        "An Admin can retrieve enough information from the backend to uniquely identify the Internet Identity principal associated with the profile name \"Uday Chougule\".",
        "Non-admins cannot enumerate other users (must be access-controlled)."
      ]
    },
    {
      "id": "REQ-15",
      "text": "Update the Admin > Users page to support promoting a specific user to Admin using the new backend API (including an explicit action to make \"Uday Chougule\" an Admin once that user is discoverable in the list/lookup).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Make Uday Chougule as a admin"
        ]
      },
      "acceptanceCriteria": [
        "Admin Users UI provides a clear \"Make Admin\" action for a user row or for a searched/selected user.",
        "Triggering the action calls the backend promotion API and shows success/error feedback in English.",
        "After successful promotion, the UI refreshes and shows that the user is now an Admin (role indicator updates)."
      ]
    }
  ],
  "constraints": [
    "Backend must remain a single Motoko actor with logic in backend/main.mo.",
    "Only introduce backend state migration (backend/migration.mo) if new stable state is required for user indexing/listing; follow the project’s conditional migration policy.",
    "Do not edit files under frontend/src/components/ui or other immutable frontend paths listed in SYSTEM_CONTEXT; compose them instead.",
    "Use English for all user-facing UI text."
  ],
  "nonGoals": [
    "Do not introduce any admin token system or share any tokens/secret URLs as part of this change.",
    "Do not add third-party authentication providers; continue using Internet Identity.",
    "Do not implement external database storage or off-canister user directories."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}