{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Admin Users: Promote user to Admin",
  "requirements": [
    {
      "id": "REQ-15",
      "summary": "Update Admin > Users page to search/select a user (including \"Uday Chougule\") and promote them to Admin with success/error feedback and refreshed role indicator.",
      "acceptanceCriteria": [
        "Admin Users UI provides a clear \"Make Admin\" action for a user row or for a searched/selected user.",
        "Triggering the action calls the backend promotion capability and shows success/error feedback in English.",
        "After successful promotion, the UI refreshes and shows that the user is now an Admin (role indicator updates)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Add React Query hooks to (1) find users by exact profile name via the backend capability (e.g., for \"Uday Chougule\") and (2) promote a selected user principal to admin using the backend capability; handle authorization traps as user-friendly English errors. Use the selected \"authorization\" component patterns for authenticated/role-based access flows; verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/pages/admin/AdminUsersPage.tsx",
          "operation": "modify",
          "description": "Replace the static demo users table with an admin-only user lookup/list powered by the new hooks: include an exact-name search (prefill or quick action for \"Uday Chougule\"), render search results as rows, show a clear per-row \"Make Admin\" action (disabled/hidden when already admin), and display English success/error feedback (and refresh/optimistically update the row role indicator after promotion). Use the selected \"authorization\" component guidance to handle unauthorized errors gracefully; verify the component's usage instructions before implementing."
        }
      ]
    }
  ]
}